# PANDAS

Pandas is a python library for data analysis.Data Science tool

In [1]:
import pandas as pd

In [4]:
a=pd.Series([1,2,3])

In [5]:
a

0    1
1    2
2    3
dtype: int64

In [6]:
b=pd.Series([1,2,3,4,5,6,7,8])

In [7]:
b

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [8]:
c=pd.Series([11,22,33,44,55,66])

In [9]:
c

0    11
1    22
2    33
3    44
4    55
5    66
dtype: int64

In [13]:
#pd.Series? #Details about the series

In [14]:
a=pd.Series([1,2,3],index=[1,2,3])

In [15]:
a

1    1
2    2
3    3
dtype: int64

In [18]:
b=pd.Series([11,21,31,41],index=[1,2,3,4])

In [19]:
b

1    11
2    21
3    31
4    41
dtype: int64

In [24]:
c=pd.Series([10,20,30,40,50],index=[100,200,101,201,301],dtype=float)

In [25]:
c

100    10.0
200    20.0
101    30.0
201    40.0
301    50.0
dtype: float64

In [29]:
#pd.Series? Signature(which parameters can be used)

In [30]:
#Accessing the data from series
s=pd.Series([20,30,40,50,60])
print(s[0])

20

In [31]:
s[3]

50

In [32]:
### Slicing
s[0:3]

0    20
1    30
2    40
dtype: int64

In [33]:
import numpy as np

In [34]:
data=np.array([66,77,88,99])

In [35]:
data

array([66, 77, 88, 99])

In [36]:
#We can access the data using numpy in series
s=pd.Series(data)

In [38]:
s

0    66
1    77
2    88
3    99
dtype: int32

In [39]:
#We can access dictionary also in Series
demodict={'Name':'John','Age':12}
s1=pd.Series(demodict)

In [40]:
s1

Name    John
Age       12
dtype: object

In [41]:
ckr={'Name':'Viart','Runs':200,'innings':3,'balls':56}

In [42]:
ckr

{'Name': 'Viart', 'Runs': 200, 'innings': 3, 'balls': 56}

In [43]:
d=pd.Series(ckr)

In [44]:
d

Name       Viart
Runs         200
innings        3
balls         56
dtype: object

# PANDAS DATAFRAME

In [45]:
import pandas as pd

In [46]:
data=[1,2,3,4]
df=pd.DataFrame(data)

In [47]:
df

   0
0  1
1  2
2  3
3  4

In [48]:
data=[['Alex',10],['Bob',20],['John',30]]
s=pd.DataFrame(data)
s

      0   1
0  Alex  10
1   Bob  20
2  John  30

In [49]:
data=[['Alex',10],['Bob',20],['John',30]]
s=pd.DataFrame(data,columns=['Name','Age'])
s

   Name  Age
0  Alex   10
1   Bob   20
2  John   30

In [51]:
data=[['Alex',10],['Bob',20],['John',30]]
m=pd.DataFrame(data,columns=['Name','Age'],dtype=float)
m

C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3444: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised
  exec(code_obj, self.user_global_ns, self.user_ns)

   Name   Age
0  Alex  10.0
1   Bob  20.0
2  John  30.0

In [53]:
data={'Name':['Tom','Jack','Steve','Ricky'],'Age':[23,34,21,12]}
df=pd.DataFrame(data)
df

    Name  Age
0    Tom   23
1   Jack   34
2  Steve   21
3  Ricky   12

In [54]:
#NaN(Not a number)is appended in missing areas
data=[{'a':1,'b':2},{'a':23,'b':34,'c':45}]
df=pd.DataFrame(data,dtype=float)
df

      a     b     c
0   1.0   2.0   NaN
1  23.0  34.0  45.0

In [ ]:
data=[{'a':1,'b':2},{'a':23,'b':34,'c':45}]
df=pd.DataFrame(data,index=['dtype=float)

In [11]:
import pandas as pd

In [13]:
df=pd.read_csv("hrdata.csv")
print(df)

   Emp_Id     Name      Age   Position      Salary         DOB
0     101     John       12    Manager       10000   12/2/2001
1     102     Jack       23     Senior       20000   10/1/1998
2     103    Ricky       23  Executive       10000   12/2/1992
3     104    Harry  25Sales      21000  23/10/1987         NaN
4     105    Jacky       45       Head       30000   12/1/1997
5     106     Alex       34     Dealer       21000  31/10/2001
6     107  Florina       23  Assistant       10000   21/1/2000
7     108    Alira       32     Senior       13000   12/2/2003